app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
    def set_profile
      @profile = User.find(params[:id])